### Regularized Linear Regression (ì •ê·œí™”ëœ ì„ í˜• íšŒê·€)

- ë‹¤ì¤‘ íšŒê·€ ëª¨ë¸ì€ ë³µì¡ë„ê°€ ë†’ì•„ì„œ ê³¼ëŒ€ì í•©(overfitting)ë˜ëŠ” ê²½í–¥ì´ ìˆë‹¤. ì´ë¥¼ í•´ê²°í•˜ê¸° ìœ„í•´ì„œëŠ” ê·œì œ(penalty)ë¥¼ ì£¼ì–´ ë³µì¡ë„ë¥¼ ê°ì†Œì‹œì¼œì•¼ í•œë‹¤.

#### ë¼ì˜(LASSO, Least Absolute Shrinkage and Selection Operator)
- L1 ê·œì œë¥¼ í†µí•œ ì •ê·œí™”ë¥¼ ì‚¬ìš©í•˜ëŠ” ë°©ì‹ì´ë‹¤.
- ê·œì œí•­ì´ 0ì— ìˆ˜ë ´í•  ë•Œ L1 ì •ê·œí™”ì—ì„œëŠ” ê°€ì¤‘ì¹˜(W)ê°€ 0ì´ ë  ìˆ˜ ìˆë‹¤.
- L1 NORMì˜ ê²½ìš°ì— ì ˆëŒ€ê°’ì— ëŒ€í•œ ì‹ì´ë¯€ë¡œ ë¯¸ë¶„ì´ ë¶ˆê°€ëŠ¥í•œ ì ì´ ìˆì§€ë§Œ, íŠ¹ì • ë°©ì‹ì„ í†µí•´ ë¯¸ë¶„í•˜ë©´ ê°€ì¤‘ì¹˜ê°€ 0ì´ ëœë‹¤.  
  ë”°ë¼ì„œ ê²½ì‚¬í•˜ê°•ë²•ì„ í†µí•´ í•™ìŠµí•˜ëŠ” ëª¨ë¸ì—ëŠ” ì í•©í•˜ì§€ ì•Šë‹¤.
- ì¤‘ìš”í•˜ì§€ ì•Šì€ featureë“¤ì€ ëª¨ë¸ì—ì„œ ì œì™¸í•˜ì—¬ ëª¨ë¸ì„ ë‹¨ìˆœí•˜ê²Œ ë§Œë“¤ê³ , ê°€ì¥ ì˜í–¥ë ¥ì´ í° íŠ¹ì„±ì´ ë¬´ì—‡ì¸ì§€ ì•Œ ìˆ˜ ìˆê¸° ë•Œë¬¸ì— ëª¨ë¸ì˜ í•´ì„ë ¥ì´ ì¢‹ì•„ì§„ë‹¤.

<div style="display: flex; margin-top:20px">
    <div>
        <img src="./images/regularized01.png" width="350" style="margin-left: 30px">
    </div>
    <div>
        <img src="./images/regularized02.png" style="margin-left: 50px">
    </div>
</div>

#### ë¦¿ì§€ (Ridge)
- L2 ê·œì œë¥¼ í†µí•œ ì •ê·œí™”ë¥¼ ì‚¬ìš©í•˜ëŠ” ë°©ì‹ì´ë‹¤.
- ê·œì œí•­ì´ 0ì— ìˆ˜ë ´í•  ë•Œ L2 ì •ê·œí™”ì˜ ê²½ìš° ê°€ì¤‘ì¹˜ëŠ” 0ì´ ë  ìˆ˜ ì—†ë‹¤.
- L2 NORMì˜ ê²½ìš° ë¯¸ë¶„í–ˆì„ ë•Œ ê°€ì¤‘ì¹˜ê°€ ë‚¨ì•„ìˆê¸° ë•Œë¬¸ì—, ê²½ì‚¬í•˜ê°•ë²•ì„ í†µí•´ í•™ìŠµí•˜ëŠ” ëª¨ë¸ì— ì í•©í•˜ë‹¤.
- ê°’ì´ 0ì´ ë˜ì–´ ì œì™¸ë˜ëŠ” featureê°€ ì—†ì§€ë§Œ, ê³¨ê³ ë£¨ 0ì— ê°€ê¹Œìš´ ê°’ìœ¼ë¡œ ì‘ì•„ì§€ê¸° ë•Œë¬¸ì— ì¥ê¸°ì ìœ¼ë¡œ ë” ì¢‹ì€ ëª¨ë¸ì´ ëœë‹¤.

<div style="display: flex; margin-top:20px">
    <div>
        <img src="./images/regularized03.png" width="350" style="margin-left: 30px">
    </div>
    <div>
        <img src="./images/regularized04.png" style="margin-left: 50px">
    </div>
</div>

**Î» (Regulation parameter)**
- ìˆ˜í•™ì ìœ¼ë¡œëŠ” ëŒë‹¤ë¼ê³  í•¨.
- Î»ì´ ì»¤ì§€ë©´ loss functionì„ ìµœì†Œí™”í•˜ëŠ” ê³¼ì •ì—ì„œ NORMì´ ì‘ì•„ì§€ë¯€ë¡œ ê·œì œê°€ ê°•í•´ì¡Œë‹¤ê³  í‘œí˜„í•œë‹¤.
- Î»ì´ ì‘ì•„ì§€ë©´ loss functionì„ ìµœì†Œí™”í•˜ëŠ” ê³¼ì •ì—ì„œ NORMì´ ì»¤ì§€ë¯€ë¡œ ê·œì œê°€ ì•½í•´ì¡Œë‹¤ê³  í‘œí˜„í•œë‹¤.

##### í•œêµ­ì¸ ìˆ˜ìµ ì˜ˆì¸¡
- id : ì‹ë³„ ë²ˆí˜¸
- year : ì¡°ì‚¬ ë…„ë„
- wave : 2005ë…„ wave 1ìœ„ë¶€í„° 2018ë…„ wave 14ìœ„ê¹Œì§€
- region: 1)ì„œìš¸ 2)ê²½ê¸° 3)ê²½ë‚¨ 4)ê²½ë¶ 5)ì¶©ë‚¨ 6)ê°•ì› & ì¶©ë¶ 7)ì „ë¼ & ì œì£¼
- income: ì—°ê°„ ìˆ˜ì… Mì›(ë°±ë§Œì›.1100ì›=1USD)
- family_member: ê°€ì¡± êµ¬ì„±ì› ìˆ˜
- gender: 1) ë‚¨ì„± 2) ì—¬ì„±
- year_born: íƒœì–´ë‚œ ë…„ë„
- education_level:1)ë¬´êµìœ¡(7ì„¸ ë¯¸ë§Œ) 2)ë¬´êµìœ¡(7ì„¸ ì´ìƒ) 3)ì´ˆë“±í•™êµ 4)ì¤‘í•™êµ 5)ê³ ë“±í•™êµ 6)ëŒ€í•™ í•™ìœ„ 8)MA 9)ë°•ì‚¬ í•™ìœ„
- marriage: í˜¼ì¸ìƒíƒœ. 1)í•´ë‹¹ì—†ìŒ(18ì„¸ ë¯¸ë§Œ) 2)í˜¼ì¸ì¤‘ 3)ì‚¬ë§ìœ¼ë¡œ ë³„ê±°ì¤‘ 4)ë³„ê±°ì¤‘ 5)ë¯¸í˜¼ 6)ê¸°íƒ€
- religion: 1) ì¢…êµ ìˆìŒ 2) ì¢…êµ ì—†ìŒ  
- occupation: ì§ì¢… ì½”ë“œ, ë³„ë„ ì²¨ë¶€
- company_size: ê¸°ì—… ê·œëª¨
- reason_none_worker: 1)ëŠ¥ë ¥ ì—†ìŒ 2)êµ° ë³µë¬´ ì¤‘ 3)í•™êµì—ì„œ ê³µë¶€ ì¤‘ 4)í•™êµ ì¤€ë¹„ 5)ì§ì¥ì¸ 7)ì§‘ì—ì„œ ëŒë³´ëŠ” ì•„ì´ë“¤ 8)ê°„í˜¸ 9)ê²½ì œ í™œë™ í¬ê¸° 10)ì¼í•  ì˜ì‚¬ ì—†ìŒ 11)ê¸°íƒ€

In [1]:
import pandas as pd

i_df = pd.read_csv('./datasets/korean_income.csv', low_memory=False)
i_df

,id,year,wave,region,income,family_member,gender,year_born,education_level,marriage,religion,occupation,company_size,reason_none_worker
0,10101,2005,1,1,614.0,1,2,1936,2,2,2,,,8
1,10101,2011,7,1,896.0,1,2,1936,2,2,2,,,10
2,10101,2012,8,1,1310.0,1,2,1936,2,2,2,,,10
3,10101,2013,9,1,2208.0,1,2,1936,2,2,2,,,1
4,10101,2014,10,1,864.0,1,2,1936,2,2,2,,,10
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
92852,98000701,2014,10,5,11600.0,6,1,1967,5,1,1,874,1,
92853,98000701,2015,11,5,8327.0,6,1,1967,5,1,1,874,1,
92854,98000701,2016,12,5,7931.0,6,1,1967,5,1,1,874,1,
92855,98000701,2017,13,5,8802.0,5,1,1967,5,1,1,874,1,
92856,98000701,2018,14,5,6747.0,6,1,1967,5,1,1,874,1,

#### ğŸ“Š ë°ì´í„° ì •ë³´

In [2]:
# ë°ì´í„° ì„¸íŠ¸ ì •ë³´ í™•ì¸
i_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 92857 entries, 0 to 92856
Data columns (total 14 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  92857 non-null  int64
 1   year                92857 non-null  int64
 2   wave                92857 non-null  int64
 3   region              92857 non-null  int64
 4   income              92857 non-null  float64
 5   family_member       92857 non-null  int64
 6   gender              92857 non-null  int64
 7   year_born           92857 non-null  int64
 8   education_level     92857 non-null  int64
 9   marriage            92857 non-null  int64
 10  religion            92857 non-null  int64
 11  occupation          92857 non-null  object
 12  company_size        92857 non-null  object
 13  reason_none_worker  92857 non-null  object
dtypes: float64(1), int64(10), object(3)
memory usage: 9.9+ MB

In [3]:
i_df.occupation.value_counts()

occupation
        33643
611     10079
941      2800
873      2595
312      2211
        ...
1009        2
113         1
12          1
828         1
122         1
Name: count, Length: 244, dtype: int64

#### ğŸ“Š ì „ì²˜ë¦¬

In [4]:
# ì§ì¢… ì½”ë“œê°€ ì—†ëŠ” ë°ì´í„° í™•ì¸
i_df[i_df.occupation == ' ']

,id,year,wave,region,income,family_member,gender,year_born,education_level,marriage,religion,occupation,company_size,reason_none_worker
0,10101,2005,1,1,614.0,1,2,1936,2,2,2,,,8
1,10101,2011,7,1,896.0,1,2,1936,2,2,2,,,10
2,10101,2012,8,1,1310.0,1,2,1936,2,2,2,,,10
3,10101,2013,9,1,2208.0,1,2,1936,2,2,2,,,1
4,10101,2014,10,1,864.0,1,2,1936,2,2,2,,,10
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
92843,97990701,2012,8,6,1591.0,2,1,1932,2,1,2,,,1
92845,97990701,2014,10,6,1612.0,2,1,1932,2,1,2,,,10
92846,97990701,2015,11,6,1899.0,2,1,1932,2,1,2,,,10
92847,97990701,2016,12,6,1770.3,2,1,1932,2,1,2,,,10
92848,97990701,2017,13,6,1446.3,1,2,1933,2,2,2,,,10

In [5]:
# ë°ì´í„° í”„ë ˆì„ ë³µì œ
pre_i_df = i_df.copy()

# ë°±ìˆ˜ì¸ ì‚¬ëŒì€ ì§ì—… ì½”ë“œê°€ ì—†ê¸° ë•Œë¬¸ì— 0ìœ¼ë¡œ ì„ì˜ ì„¤ì •
pre_i_df.loc[:, 'occupation'] = i_df.occupation.apply(lambda x: x.replace(' ', '0'))

#### â— ì´ìŠˆ
<code>i_df.loc[:, 'occupation'] = i_df.occupation.apply(lambda x: x.replace(' ', 0))</code>  
replace() argument 2 must be str, not int

#### ğŸ’¡ í•´ê²°
- í˜„ì¬ occupationì´ object í˜•ì‹ì´ë¼ int ë¬¸ìì—´ë¡œ ë³€ê²½ì´ ë¶ˆê°€í•˜ë¯€ë¡œ, 0ì„ ë¬¸ìì—´ë¡œ ì…ë ¥í•´ì£¼ê¸°

In [6]:
import numpy as np

# ì •ìˆ˜ë¡œ í˜•ë³€í™˜
pre_i_df.occupation = pre_i_df.occupation.astype(np.int16)

#### â— ì´ìŠˆ
<code>i_df.occupation.astype(np.int16)</code>  
invalid literal for int() with base 10: ' '

#### ğŸ’¡ í•´ê²°
- objectë¥¼ int16ìœ¼ë¡œ ë³€í™˜í•˜ë ¤ê³  í–ˆë”ë‹ˆ ê³µë°±ì´ ìˆì–´ ë³€í™˜ì´ ë¶ˆê°€ëŠ¥í•˜ë‹¤ê³  í•¨.
- ê³µë°±ì´ ì™œ ìˆëŠ”ì§€ reason_none_worker í”¼ì²˜ì—ì„œ ë°±ìˆ˜ì¸ì§€ í™•ì¸ í›„ ë°±ìˆ˜ì¸ ì‚¬ëŒë“¤ì€ 0ì¸ ì§ì—… ì½”ë“œë¥¼ ì„ì˜ë¡œ ì„¤ì •í•˜ì—¬ ë³€í™˜í•´ì¤˜ì•¼ í•¨.
- í•´ë‹¹ ì½”ë“œëŠ” ìœ„ì—ì„œ ë¨¼ì € ì§„í–‰í•´ì•¼ í•¨.

In [7]:
# # ì§ì¢… ì½”ë“œê°€ 0(ë°±ìˆ˜)ì¸ ë°ì´í„° ë”°ë¡œ ì €ì¥
# pre_i_0_df = pre_i_df[pre_i_df.occupation == 0]
# pre_i_0_df

In [8]:
# # ì´ìƒì¹˜ ì œê±°(ì§ì¢… ì½”ë“œì— ì—†ëŠ” ë²ˆí˜¸ ì œê±°)
# pre_i_df.drop(index=pre_i_df[~pre_i_df.occupation.between(11, 1012)].index, axis=0)

In [9]:
# # ì •ìƒ ì§ì¢…ì½”ë“œ ë° 0 ë°ì´í„° í•©ì¹˜ê¸°
# pd.concat([pre_i_df, pre_i_0_df], axis=0)

In [10]:
# # ì¸ë±ìŠ¤ ë²ˆí˜¸ ì´ˆê¸°í™”
# pre_i_df.reset_index(drop=True, inplace=True)

In [11]:
pre_i_df

,id,year,wave,region,income,family_member,gender,year_born,education_level,marriage,religion,occupation,company_size,reason_none_worker
0,10101,2005,1,1,614.0,1,2,1936,2,2,2,0,,8
1,10101,2011,7,1,896.0,1,2,1936,2,2,2,0,,10
2,10101,2012,8,1,1310.0,1,2,1936,2,2,2,0,,10
3,10101,2013,9,1,2208.0,1,2,1936,2,2,2,0,,1
4,10101,2014,10,1,864.0,1,2,1936,2,2,2,0,,10
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
92852,98000701,2014,10,5,11600.0,6,1,1967,5,1,1,874,1,
92853,98000701,2015,11,5,8327.0,6,1,1967,5,1,1,874,1,
92854,98000701,2016,12,5,7931.0,6,1,1967,5,1,1,874,1,
92855,98000701,2017,13,5,8802.0,5,1,1967,5,1,1,874,1,
92856,98000701,2018,14,5,6747.0,6,1,1967,5,1,1,874,1,

In [12]:
# ì§ì¢… ì½”ë“œ ë°ì´í„° ì„¸íŠ¸ í˜¸ì¶œ
j_df = pd.read_csv('./datasets/korean_job_code.csv')
j_df

,job_code,job_title,Unnamed: 2,Unnamed: 3,Unnamed: 4
0,0,ë°±ìˆ˜,NaN,NaN,NaN
1,11,Senior public and corporate positions,NaN,NaN,NaN
2,111,Assembly members,senior public officials and executives of pub...,NaN,NaN
3,112,senior corporate executive,NaN,NaN,NaN
4,12,Administrative and management support manageri...,NaN,NaN,NaN
...,...,...,...,...,...
196,991,Simple workers related to agriculture,forestry and fishing,NaN,NaN
197,992,Employees related to meter reading,collection and parking,NaN,NaN
198,999,Other service related simple employees,NaN,NaN,NaN
199,1011,Military officer,NaN,NaN,NaN
200,1012,Long-term sergeant and warrant officer,NaN,NaN,NaN

In [13]:
# ì§ë™ ì½”ë“œ í™•ì¸
j_df.loc[:, 'job_code']

0         0
1        11
2       111
3       112
4        12
       ...
196     991
197     992
198     999
199    1011
200    1012
Name: job_code, Length: 201, dtype: int64

In [14]:
# ì§ì¢… ì½”ë“œì— ì—†ëŠ” ë°ì´í„° ì œê±° í›„ ì¸ë±ìŠ¤ ì´ˆê¸°í™”
pre_i_df = pre_i_df[pre_i_df.occupation.isin(j_df.loc[:, 'job_code'].values)].reset_index(drop=True)
pre_i_df

,id,year,wave,region,income,family_member,gender,year_born,education_level,marriage,religion,occupation,company_size,reason_none_worker
0,10101,2005,1,1,614.0,1,2,1936,2,2,2,0,,8
1,10101,2011,7,1,896.0,1,2,1936,2,2,2,0,,10
2,10101,2012,8,1,1310.0,1,2,1936,2,2,2,0,,10
3,10101,2013,9,1,2208.0,1,2,1936,2,2,2,0,,1
4,10101,2014,10,1,864.0,1,2,1936,2,2,2,0,,10
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
86887,98000701,2014,10,5,11600.0,6,1,1967,5,1,1,874,1,
86888,98000701,2015,11,5,8327.0,6,1,1967,5,1,1,874,1,
86889,98000701,2016,12,5,7931.0,6,1,1967,5,1,1,874,1,
86890,98000701,2017,13,5,8802.0,5,1,1967,5,1,1,874,1,
86891,98000701,2018,14,5,6747.0,6,1,1967,5,1,1,874,1,

In [15]:
pre_i_df.company_size.value_counts()

company_size
      33642
1     25193
10     6430
3      5849
2      4974
7      3209
4      2417
5      1693
6      1241
9      1030
8       958
11      250
99        6
Name: count, dtype: int64

In [16]:
# ê¸°ì—… ê·œëª¨ê°€ 99ì¸ ë°ì´í„° í™•ì¸
pre_i_df[pre_i_df.company_size == '99']

,id,year,wave,region,income,family_member,gender,year_born,education_level,marriage,religion,occupation,company_size,reason_none_worker
1909,2050101,2005,1,1,600.0,2,1,1942,2,1,1,0,99,9
4446,4640101,2005,1,1,5300.0,2,1,1968,5,1,2,843,99,
9870,10470101,2008,4,1,3227.0,5,1,1970,5,1,2,753,99,
34049,34220101,2005,1,2,3665.0,4,1,1963,4,1,2,842,99,
41946,42660101,2005,1,2,12240.0,5,1,1957,8,1,9,751,99,
45064,45470101,2005,1,6,5556.0,2,1,1977,7,1,2,311,99,

In [17]:
# ê¸°ì—… ê·œëª¨ê°€ ê³µë°±ì¸ ë°ì´í„° ë‹´ê¸°
test_df = pre_i_df[pre_i_df.company_size == ' ']
# ê¸°ì—… ê·œëª¨ê°€ ê³µë°±ì´ê³  ì§ì¢… ì½”ë“œê°€ 0(ë¬´ì§)ì´ ì•„ë‹Œ ë°ì´í„° í™•ì¸
# ì—†ìœ¼ë©´ ê³µë°±ì€ ëª¨ë‘ ë¬´ì§ì´ë¯€ë¡œ 0(ì—†ìŒ)ìœ¼ë¡œ ë³€ê²½
test_df[test_df.occupation != 0]

Empty DataFrame
Columns: [id, year, wave, region, income, family_member, gender, year_born, education_level, marriage, religion, occupation, company_size, reason_none_worker]
Index: []

In [18]:
# íšŒì‚¬ ê·œëª¨ê°€ ê³µë°±ì¸ ê°’ì„ 0ìœ¼ë¡œ ë³€ê²½
pre_i_df.loc[:, 'company_size'] = pre_i_df.company_size.apply(lambda x: x.replace(' ', '0'))
# íšŒì‚¬ ê·œëª¨ê°€ 99ì¸ ë°ì´í„° ì œê±°
pre_i_df = pre_i_df.drop(index=pre_i_df[pre_i_df.company_size == '99'].index, axis=0)

In [19]:
# íšŒì‚¬ ê·œëª¨ ì •ìˆ˜ë¡œ í˜•ë³€í™˜
pre_i_df.company_size = pre_i_df.company_size.astype(np.int16)
pre_i_df.company_size.value_counts()

company_size
0     33642
1     25193
10     6430
3      5849
2      4974
7      3209
4      2417
5      1693
6      1241
9      1030
8       958
11      250
Name: count, dtype: int64

In [20]:
pre_i_df.reason_none_worker.value_counts()

reason_none_worker
      54740
10    19091
8      4275
9      2685
1      2499
7      1119
6      1074
4       704
5       326
11      237
99       76
3        52
2         7
0         1
Name: count, dtype: int64

In [21]:
# ì¼ì„ ì•ˆ í•˜ëŠ” ì´ìœ ê°€ ê³µë°±ì¸ ë°ì´í„° ë‹´ê¸°
test_df = pre_i_df[pre_i_df.reason_none_worker == ' ']
# ì¼ì„ ì•ˆ í•˜ëŠ” ì´ìœ ê°€ ê³µë°±ì´ê³  ì§ì¢… ì½”ë“œê°€ 0(ë¬´ì§)ì¸ ë°ì´í„° ê°œìˆ˜ í™•ì¸
(test_df.occupation == 0).sum()

1496

In [22]:
pre_i_df.loc[test_df[test_df.occupation == 0].index, 'reason_none_worker'] = 11

In [23]:
test_df[test_df.occupation == 0].index

Index([   30,    86,   100,   116,   117,   118,   119,   120,   121,   122,
       ...
       86015, 86211, 86212, 86216, 86342, 86570, 86591, 86724, 86780, 86823],
      dtype='int64', length=1496)

In [24]:
print((pre_i_df.occupation != 0).sum())
print((pre_i_df.reason_none_worker == ' ').sum())
print(pre_i_df[pre_i_df.occupation == 0].reason_none_worker.value_counts())
print(pre_i_df.reason_none_worker.value_counts())

53244
53244
reason_none_worker
10    19091
8      4275
9      2685
1      2499
11     1496
7      1119
6      1074
4       704
5       326
11      237
99       76
3        52
2         7
0         1
Name: count, dtype: int64
reason_none_worker
      53244
10    19091
8      4275
9      2685
1      2499
11     1496
7      1119
6      1074
4       704
5       326
11      237
99       76
3        52
2         7
0         1
Name: count, dtype: int64

In [25]:
pre_i_df.loc[pre_i_df[pre_i_df.reason_none_worker == '0'].index, 'reason_none_worker'] = 11
pre_i_df.reason_none_worker.value_counts()

reason_none_worker
      53244
10    19091
8      4275
9      2685
1      2499
11     1497
7      1119
6      1074
4       704
5       326
11      237
99       76
3        52
2         7
Name: count, dtype: int64

In [26]:
pre_i_df.loc[:, 'reason_none_worker'] = \
pre_i_df.reason_none_worker.apply(lambda x: str(x).replace('99', '11'))

pre_i_df.loc[:, 'reason_none_worker'] = \
pre_i_df.reason_none_worker.apply(lambda x: str(x).replace(' ', '0'))

In [27]:
pre_i_df.reason_none_worker.value_counts()

reason_none_worker
0     53244
10    19091
8      4275
9      2685
1      2499
11     1810
7      1119
6      1074
4       704
5       326
3        52
2         7
Name: count, dtype: int64

In [28]:
pre_i_df.reason_none_worker = pre_i_df.reason_none_worker.astype(np.int16)

In [29]:
pre_i_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 86886 entries, 0 to 86891
Data columns (total 14 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  86886 non-null  int64
 1   year                86886 non-null  int64
 2   wave                86886 non-null  int64
 3   region              86886 non-null  int64
 4   income              86886 non-null  float64
 5   family_member       86886 non-null  int64
 6   gender              86886 non-null  int64
 7   year_born           86886 non-null  int64
 8   education_level     86886 non-null  int64
 9   marriage            86886 non-null  int64
 10  religion            86886 non-null  int64
 11  occupation          86886 non-null  int16
 12  company_size        86886 non-null  int16
 13  reason_none_worker  86886 non-null  int16
dtypes: float64(1), int16(3), int64(10)
memory usage: 10.5 MB

In [ ]:
pre_i_df = pre_i_df.drop(labels='id', axis=1)

In [31]:
test_df = pd.DataFrame([[1, 2, 0], [4, 5, 0], [6, 7, 0]], columns=['x1', 'x2', 'x3'])
test_df

   x1  x2  x3
0   1   2   0
1   4   5   0
2   6   7   0

In [34]:
# 2005~2024
def inflation(years, incomes):
    interests = {'2005': 43.9,
                '2006':,
                '2007':,
                '2008':,
                '2009':,
                '2010':,
                '2011':,
                '2012':,
                '2013':,
                '2014':,
                '2015':,
                '20':,
                '20':,
                '20':,
                '20':,}
    for i, income in enumerate(incomes):
        income * (1 + dict())

SyntaxError: expression expected after dictionary key and ':' (1608229825.py, line 4)

In [32]:
pre_i_df.year.values
pre_i_df.income.values

array([ 614.,  896., 1310., ..., 7931., 8802., 6747.])